# vsoSetHandingInfo

## Description
Sets the Handing parameter values.

```pascal
PROCEDURE vsoSetHandingInfo(
				message         : LONGINT;
				isz_index       : INTEGER;
				VAR newValue    : REAL;
				VAR isSupported : BOOLEAN);
```

```python

def vs.vsoSetHandingInfo(message, isz_index):
    return (newValue, isSupported)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|LONGINT||
|isz_index|INTEGER||
|newValue|REAL||
|isSupported|BOOLEAN||

## Version
Availability: from Vectorworks 2024
## Category
* Object Events